# read design 
read_verilog controller.v

# elaborate design hierarchy
hierarchy -check -top controller

# the high-level stuff
proc; 
opt; 
fsm; 
opt; 
memory; 
opt;

# mapping to internal cell library
techmap; 
opt;

# Generate GraphViz output
show

# cleanup
clean

# write rtl synthesized design
write_verilog controller_rtlil.v
